[
    {
        "user": "user",
        "message": "what's my current status",
        "date": "2025-01-25 18:35:47"
    },
    {
        "user": "bloom",
        "message": "Hey Steve! Right now, you’re admitted to the hospital, and it looks like you’ve had some imaging and lab tests done, and those results are all in. You've been here for about 86 minutes, and you were classified as needing urgent care. If you have more questions or need to know what’s coming next, just let me know!",
        "date": "2025-01-25 18:35:48"
    },
    {
        "user": "user",
        "message": "yep I want to know what's happening next",
        "date": "2025-01-25 18:36:10"
    },
    {
        "user": "bloom",
        "message": "Alright, Steve! So, since you’ve already been triaged, the next step is that a doctor will come to assess your condition. They might check the test results that have come back and decide on a treatment plan for your ribs. After that, you'll either receive treatment and get ready to head home or be admitted for further care if needed. Just hang tight, and if you have more questions or need anything else, feel free to ask!",
        "date": "2025-01-25 18:36:12"
    },
    {
        "user": "user",
        "message": "hello can you hear me",
        "date": "2025-01-25 19:58:59"
    },
    {
        "user": "bloom",
        "message": "Hey there! Yes, I can hear you loud and clear. How can I help you today? If you have questions about your visit or the process here in the emergency department, just let me know!",
        "date": "2025-01-25 19:59:00"
    },
    {
        "user": "user",
        "message": "hello can you hear me",
        "date": "2025-01-25 19:59:49"
    },
    {
        "user": "bloom",
        "message": "Hey there! Yes, I can hear you just fine. What do you need help with today? If you have questions about your visit or the emergency department process, I'm here for you!",
        "date": "2025-01-25 19:59:51"
    },
    {
        "user": "user",
        "message": "that's great but do you know what my status",
        "date": "2025-01-25 20:00:11"
    },
    {
        "user": "bloom",
        "message": "Right now, you’re in the triage phase, which means you’ve been assessed, and they’ve classified your condition as urgent. You've been waiting for about 87 minutes, so hang in there! The next step will be a doctor coming to take a closer look at your situation and figure out a treatment plan. If you have any more questions about what’s happening or what to expect, just let me know!",
        "date": "2025-01-25 20:00:12"
    }
]