[
    {
        "user": "user",
        "message": "okay so I have a cold right now what are some advice you have for me",
        "date": "2025-01-25 23:04:36"
    },
    {
        "user": "bloom",
        "message": "Oh no, a cold! 🤧 While I'm not a medical expert, I can offer a few friendly tips on what you can do while you wait for your care! Make sure to drink plenty of fluids—water, herbal teas, those cozy drinks! They can really help. Rest is super important too; it’s like giving your body a little flower power to heal! 🌼 If you can, try some honey or warm soup; both are comforting. 😌  And hey, don’t hesitate to share how you're feeling with the team here! They’re the best at helping you out. Is there anything else fun or floral you'd like to chat about while you're here? 😊",
        "date": "2025-01-25 23:04:38"
    },
    {
        "user": "user",
        "message": "hello how are you what's",
        "date": "2025-01-25 23:07:22"
    },
    {
        "user": "bloom",
        "message": "Hey there, blooming buddy! 🌼 I’m doing great, thanks for asking! How about you? So, you were asking about “what’s” – did you mean what’s happening in the ED or something else? I’m all ears and ready to help you blossom with knowledge! 😄✨",
        "date": "2025-01-25 23:07:23"
    },
    {
        "user": "user",
        "message": "hello can you talk to me",
        "date": "2025-01-25 23:09:40"
    },
    {
        "user": "bloom",
        "message": "Hey there, lovely! 🌻 I'm so happy to be chatting with you! What's up? Anything on your mind about the ED or just looking for someone to talk to? I'm all ears and ready to help you bloom with info! 😊✨",
        "date": "2025-01-25 23:09:41"
    },
    {
        "user": "user",
        "message": "hi what's my current status",
        "date": "2025-01-25 23:34:23"
    },
    {
        "user": "bloom",
        "message": "Hey there, blooming star! 🌼 So, here’s the scoop on your current status: You're still in the \"investigations pending\" phase. You've got imaging ordered and labs that are still in progress. Right now, you're sitting at position 3 out of 25 in the queue—you're almost there! 🌟 You've been here for about 227 minutes, but don't worry; the team is working hard behind the scenes for you. If there's anything else you'd like to know or if you just want to chat, I'm right here! 😊✨",
        "date": "2025-01-25 23:34:25"
    },
    {
        "user": "user",
        "message": "hey how are you",
        "date": "2025-01-25 23:35:18"
    },
    {
        "user": "bloom",
        "message": "Hey there, beautiful bloom! 🌸 I'm doing just peachy, thanks for asking! How about you? You hanging in there? If you have any questions or just wanna chat, I'm all ears! 🌼✨",
        "date": "2025-01-25 23:35:19"
    }
]