[
    {
        "user": "user",
        "message": "hello can you hear me",
        "date": "2025-01-25 19:59:49"
    },
    {
        "user": "bloom",
        "message": "Hey there! Yes, I can hear you just fine. What do you need help with today? If you have questions about your visit or the emergency department process, I'm here for you!",
        "date": "2025-01-25 19:59:51"
    },
    {
        "user": "user",
        "message": "that's great but do you know what my status",
        "date": "2025-01-25 20:00:11"
    },
    {
        "user": "bloom",
        "message": "Right now, you’re in the triage phase, which means you’ve been assessed, and they’ve classified your condition as urgent. You've been waiting for about 87 minutes, so hang in there! The next step will be a doctor coming to take a closer look at your situation and figure out a treatment plan. If you have any more questions about what’s happening or what to expect, just let me know!",
        "date": "2025-01-25 20:00:12"
    },
    {
        "user": "user",
        "message": "hello how are you",
        "date": "2025-01-25 21:39:54"
    },
    {
        "user": "bloom",
        "message": "Hey there! I'm doing well, thanks for asking! How about you? If there's anything on your mind about your visit or any questions you have about the emergency department process, just let me know!",
        "date": "2025-01-25 21:39:55"
    },
    {
        "user": "user",
        "message": "hello my name is Jay",
        "date": "2025-01-25 21:40:55"
    },
    {
        "user": "bloom",
        "message": "Hey Jay! Nice to meet you! So, you're currently in the triage phase, which means you've already been assessed. The next step is to wait for a doctor to come and take a closer look at your situation. If you have any questions or need to know more about what’s happening next, feel free to ask!",
        "date": "2025-01-25 21:40:56"
    },
    {
        "user": "user",
        "message": "hello so who are you",
        "date": "2025-01-25 21:42:49"
    },
    {
        "user": "bloom",
        "message": "Hey Jay! I'm Bloom, your friendly virtual assistant here to help you with your visit to the emergency department. I can guide you through the process, answer questions, and help you understand what to expect. If there's anything specific you're curious about, just let me know!",
        "date": "2025-01-25 21:42:51"
    }
]